{
  "type_to_id": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "tpp_type_6": 4,
    "tpp_type_0": 5,
    "tpp_type_8": 6,
    "tpp_type_7": 7,
    "tpp_type_4": 8,
    "tpp_type_1": 9,
    "tpp_type_14": 10,
    "tpp_type_11": 11,
    "tpp_type_3": 12,
    "tpp_type_5": 13,
    "tpp_type_9": 14,
    "tpp_type_10": 15,
    "tpp_type_2": 16,
    "tpp_type_15": 17,
    "tpp_type_13": 18,
    "tpp_type_12": 19,
    "tpp_type_17": 20,
    "tpp_type_18": 21,
    "tpp_type_16": 22,
    "tpp_type_19": 23,
    "tpp_type_20": 24,
    "tpp_type_21": 25,
    "commodity_price_stable": 26,
    "commodity_price_drift": 27,
    "commodity_price_spike": 28,
    "commodity_price_drop": 29,
    "trial_preclinical_start": 30,
    "trial_phase1_start": 31,
    "trial_enrollment_complete": 32,
    "trial_phase2_start": 33,
    "trial_interim_analysis": 34,
    "trial_phase2_failure": 35,
    "trial_phase1_failure": 36,
    "trial_safety_signal": 37,
    "trial_phase3_start": 38,
    "trial_endpoint_missed": 39,
    "trial_endpoint_met": 40,
    "trial_approval": 41,
    "weather_tropical_disturbance": 42,
    "weather_tropical_storm": 43,
    "weather_hurricane": 44,
    "weather_storm_surge": 45,
    "weather_landfall": 46,
    "weather_flooding": 47,
    "weather_cold_front": 48,
    "weather_winter_warning": 49,
    "weather_heavy_snow": 50,
    "weather_ice_storm": 51,
    "weather_blizzard": 52,
    "weather_power_outage": 53,
    "weather_road_closure": 54,
    "weather_heat_advisory": 55,
    "weather_excessive_heat": 56,
    "weather_drought": 57,
    "weather_heavy_rain": 58,
    "weather_flash_flood_watch": 59,
    "weather_flash_flood_warning": 60,
    "weather_river_flood": 61,
    "weather_evacuation": 62,
    "weather_heat_buildup": 63,
    "weather_severe_watch": 64,
    "weather_severe_warning": 65,
    "weather_thunderstorm": 66,
    "weather_hail": 67,
    "weather_wildfire_start": 68,
    "weather_wildfire_spread": 69,
    "weather_rescue_operations": 70,
    "weather_tornado_warning": 71,
    "weather_tornado": 72,
    "weather_air_quality_alert": 73,
    "cyber_port_scan": 74,
    "cyber_exploit_attempt": 75,
    "cyber_initial_access": 76,
    "cyber_credential_dump": 77,
    "cyber_alert_triggered": 78,
    "cyber_traffic_spike": 79,
    "cyber_syn_flood": 80,
    "cyber_service_degradation": 81,
    "cyber_service_outage": 82,
    "cyber_phishing": 83,
    "cyber_payload_download": 84,
    "cyber_privilege_escalation": 85,
    "cyber_lateral_movement": 86,
    "cyber_data_encryption": 87,
    "cyber_ransom_note": 88,
    "cyber_dependency_compromise": 89,
    "cyber_update_poisoned": 90,
    "cyber_backdoor_active": 91,
    "cyber_mitigation_active": 92,
    "cyber_service_restored": 93,
    "cyber_c2_communication": 94,
    "cyber_unusual_access": 95,
    "cyber_privilege_abuse": 96,
    "cyber_data_exfiltration": 97,
    "cyber_data_access_spike": 98,
    "cyber_unauthorized_copy": 99,
    "cyber_exfiltration": 100,
    "cyber_detection": 101,
    "cyber_incident_response": 102
  },
  "frozen": true
}